# SomeElementsPreventAssemblyTypeChange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..SomeElementsPreventAssemblyTypeChange Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Assembly cannot be changed to selected type. Some elements in the target assembly prevent the type change from occurring. These tend to be parts and nested elements such as mullion, curtain panels, and members of trusses.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SomeElementsPreventAssemblyTypeChange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SomeElementsPreventAssemblyTypeChange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SomeElementsPreventAssemblyTypeChange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace